---
kind: property
id: P:Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType
source: html/45659568-cb90-6712-3355-120f7cff9dd4.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType Property

The storage type of the value stored in this entry.

## Syntax (C#)
```csharp
public StorageType StorageType { get; }
```